app/views/favorites/index.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`topic_id` = 1
---
              <h3>コメント</h3>
              <% topic.comments.each do |c| %>