app/views/topics/index.html.erb

            <%= image_tag topic.image.url %>
            <% if !topic.favorite_users.include?(current_user) %>
---
SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`topic_id` IN (1, 2, 3, 4, 5, 6, 7, 8)

              <h3>コメント</h3>
              <% topic.comments.each do |c| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`topic_id` = 1