app/controllers/comments_controller.rb

  def new
    @comment = Comment.new
    @topic = Topic.find(params[:topic_id])
---
SELECT  `topics`.* FROM `topics` WHERE `topics`.`id` = 1 LIMIT 1

  def create
    @comment = current_user.comments.new(comment_params)
    @comment.user_id = current_user.id
    @comment.topic_id = params[:topic_id]

    if @comment.save
---
INSERT INTO `comments` (`content`, `user_id`, `topic_id`, `created_at`, `updated_at`) VALUES ('g;fdjsgjfdg;lfksh;lf;f', 1, 1, '2020-05-08 07:39:54', '2020-05-08 07:39:54')