app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'doi-b.goode@docomo.ne.jp' LIMIT 1