app/controllers/topics_controller.rb

SELECT `topics`.* FROM `topics`
---
  def index
    @topics = Topic.all.includes(:favorite_users)

INSERT INTO `topics` (`user_id`, `description`, `image`, `created_at`, `updated_at`) VALUES (1, 'food', 'pic-3.jpg', '2020-05-04 04:22:21', '2020-05-04 04:22:21')
---
  def create
    @topic = current_user.topics.new(topic_params)

    if @topic.save